/* localize the predicate template for city */
"%[addresses.city]@ %[is set]@" = "%1$[City]@ %2$[is set]@";
"%[addresses.city]@ %[is not set]@" = "%1$[City]@ %2$[is not set]@";

/* localize the predicate template for city */
"%[addresses.city]@ %[is]@ %@" = "%1$[City]@ %2$[is]@ %3$@";
"%[addresses.city]@ %[is not]@ %@" = "%1$[City]@ %2$[is not]@ %3$@";
"%[addresses.city]@ %[contains]@ %@" = "%1$[City]@ %2$[contains]@ %3$@";
"%[addresses.city]@ %[does not contain]@ %@" = "%1$[City]@ %2$[does not contain]@ %3$@";
"%[addresses.city]@ %[begins with]@ %@" = "%1$[City]@ %2$[begins with]@ %3$@";
"%[addresses.city]@ %[ends with]@ %@" = "%1$[City]@ %2$[ends with]@ %3$@";

/* localize the predicate template for country */
"%[addresses.country]@ %[is set]@" = "%1$[Country]@ %2$[is set]@";
"%[addresses.country]@ %[is not set]@" = "%1$[Country]@ %2$[is not set]@";

/* localize the predicate template for country */
"%[addresses.country]@ %[is]@ %@" = "%1$[Country]@ %2$[is]@ %3$@";
"%[addresses.country]@ %[is not]@ %@" = "%1$[Country]@ %2$[is not]@ %3$@";
"%[addresses.country]@ %[contains]@ %@" = "%1$[Country]@ %2$[contains]@ %3$@";
"%[addresses.country]@ %[does not contain]@ %@" = "%1$[Country]@ %2$[does not contain]@ %3$@";
"%[addresses.country]@ %[begins with]@ %@" = "%1$[Country]@ %2$[begins with]@ %3$@";
"%[addresses.country]@ %[ends with]@ %@" = "%1$[Country]@ %2$[ends with]@ %3$@";

/* localize the predicate template for addresses */
"%[addresses.indexString]@ %[contains]@ %@" = "%1$[Address]@ %2$[contains]@ %3$@";
"%[addresses.indexString]@ %[does not contain]@ %@" = "%1$[Address]@ %2$[does not contain]@ %3$@";

/* localize the predicate template for addresses */
"%[addresses.indexString]@ %[is set]@" = "%1$[Address]@ %2$[is set]@";
"%[addresses.indexString]@ %[is not set]@" = "%1$[Address]@ %2$[is not set]@";

/* localize the predicate template for state */
"%[addresses.state]@ %[is set]@" = "%1$[State]@ %2$[is set]@";
"%[addresses.state]@ %[is not set]@" = "%1$[State]@ %2$[is not set]@";

/* localize the predicate template for state */
"%[addresses.state]@ %[is]@ %@" = "%1$[State]@ %2$[is]@ %3$@";
"%[addresses.state]@ %[is not]@ %@" = "%1$[State]@ %2$[is not]@ %3$@";
"%[addresses.state]@ %[contains]@ %@" = "%1$[State]@ %2$[contains]@ %3$@";
"%[addresses.state]@ %[does not contain]@ %@" = "%1$[State]@ %2$[does not contain]@ %3$@";
"%[addresses.state]@ %[begins with]@ %@" = "%1$[State]@ %2$[begins with]@ %3$@";
"%[addresses.state]@ %[ends with]@ %@" = "%1$[State]@ %2$[ends with]@ %3$@";

/* localize the predicate template for zip code */
"%[addresses.zipCode]@ %[is set]@" = "%1$[ZIP/Post Code]@ %2$[is set]@";
"%[addresses.zipCode]@ %[is not set]@" = "%1$[ZIP/Post Code]@ %2$[is not set]@";

/* localize the predicate template for zip code */
"%[addresses.zipCode]@ %[is]@ %@" = "%1$[ZIP/Post Code]@ %2$[is]@ %3$@";
"%[addresses.zipCode]@ %[is not]@ %@" = "%1$[ZIP/Post Code]@ %2$[is not]@ %3$@";
"%[addresses.zipCode]@ %[contains]@ %@" = "%1$[ZIP/Post Code]@ %2$[contains]@ %3$@";
"%[addresses.zipCode]@ %[does not contain]@ %@" = "%1$[ZIP/Post Code]@ %2$[does not contain]@ %3$@";
"%[addresses.zipCode]@ %[begins with]@ %@" = "%1$[ZIP/Post Code]@ %2$[begins with]@ %3$@";
"%[addresses.zipCode]@ %[ends with]@ %@" = "%1$[ZIP/Post Code]@ %2$[ends with]@ %3$@";

/* localize the predicate template for birthday */
"%[birthdayComponents]@ %[is in the next]@ %@ %@" = "%1$[Birthday]@ %2$[is in the next]@ %3$@ %4$@";
"%[birthdayComponents]@ %[is within]@ %@ %@" = "%1$[Birthday]@ %2$[is within]@ %3$@ %4$@";
"%[birthdayComponents]@ %[is not within]@ %@ %@" = "%1$[Birthday]@ %2$[is not within]@ %3$@ %4$@";

/* localize the predicate template for birthday */
"%[birthdayComponents]@ %[is set]@" = "%1$[Birthday]@ %2$[is set]@";
"%[birthdayComponents]@ %[is not set]@" = "%1$[Birthday]@ %2$[is not set]@";

/* localize the predicate template for department */
"%[department]@ %[is set]@" = "%1$[Department]@ %2$[is set]@";
"%[department]@ %[is not set]@" = "%1$[Department]@ %2$[is not set]@";

/* localize the predicate template for department */
"%[department]@ %[is]@ %@" = "%1$[Department]@ %2$[is]@ %3$@";
"%[department]@ %[is not]@ %@" = "%1$[Department]@ %2$[is not]@ %3$@";
"%[department]@ %[contains]@ %@" = "%1$[Department]@ %2$[contains]@ %3$@";
"%[department]@ %[does not contain]@ %@" = "%1$[Department]@ %2$[does not contain]@ %3$@";

/* localize the predicate template for display name */
"%[displayName]@ %[is set]@" = "%1$[Name]@ %2$[is set]@";
"%[displayName]@ %[is not set]@" = "%1$[Name]@ %2$[is not set]@";

/* localize the predicate template for display name */
"%[displayName]@ %[is]@ %@" = "%1$[Name]@ %2$[is]@ %3$@";
"%[displayName]@ %[is not]@ %@" = "%1$[Name]@ %2$[is not]@ %3$@";
"%[displayName]@ %[contains]@ %@" = "%1$[Name]@ %2$[contains]@ %3$@";
"%[displayName]@ %[does not contain]@ %@" = "%1$[Name]@ %2$[does not contain]@ %3$@";

/* localize the predicate template for emails */
"%[emails.value]@ %[is set]@" = "%1$[Email]@ %2$[is set]@";
"%[emails.value]@ %[is not set]@" = "%1$[Email]@ %2$[is not set]@";

/* localize the predicate template for emails */
"%[emails.value]@ %[is]@ %@" = "%1$[Email]@ %2$[is]@ %3$@";
"%[emails.value]@ %[is not]@ %@" = "%1$[Email]@ %2$[is not]@ %3$@";
"%[emails.value]@ %[contains]@ %@" = "%1$[Email]@ %2$[contains]@ %3$@";
"%[emails.value]@ %[does not contain]@ %@" = "%1$[Email]@ %2$[does not contain]@ %3$@";
"%[emails.value]@ %[begins with]@ %@" = "%1$[Email]@ %2$[begins with]@ %3$@";
"%[emails.value]@ %[ends with]@ %@" = "%1$[Email]@ %2$[ends with]@ %3$@";

/* localize the predicate template for firstName */
"%[firstName]@ %[is set]@" = "%1$[First Name]@ %2$[is set]@";
"%[firstName]@ %[is not set]@" = "%1$[First Name]@ %2$[is not set]@";

/* localize the predicate template for firstName */
"%[firstName]@ %[is]@ %@" = "%1$[First Name]@ %2$[is]@ %3$@";
"%[firstName]@ %[is not]@ %@" = "%1$[First Name]@ %2$[is not]@ %3$@";
"%[firstName]@ %[contains]@ %@" = "%1$[First Name]@ %2$[contains]@ %3$@";
"%[firstName]@ %[does not contain]@ %@" = "%1$[First Name]@ %2$[does not contain]@ %3$@";

/* localize the predicate template for IM user names */
"%[instantMessageUserNames.value]@ %[is set]@" = "%1$[Instant Message]@ %2$[is set]@";
"%[instantMessageUserNames.value]@ %[is not set]@" = "%1$[Instant Message]@ %2$[is not set]@";

/* localize the predicate template for IM user names */
"%[instantMessageUserNames.value]@ %[is]@ %@" = "%1$[Instant Message]@ %2$[is]@ %3$@";
"%[instantMessageUserNames.value]@ %[is not]@ %@" = "%1$[Instant Message]@ %2$[is not]@ %3$@";
"%[instantMessageUserNames.value]@ %[contains]@ %@" = "%1$[Instant Message]@ %2$[contains]@ %3$@";
"%[instantMessageUserNames.value]@ %[does not contain]@ %@" = "%1$[Instant Message]@ %2$[does not contain]@ %3$@";
"%[instantMessageUserNames.value]@ %[begins with]@ %@" = "%1$[Instant Message]@ %2$[begins with]@ %3$@";
"%[instantMessageUserNames.value]@ %[ends with]@ %@" = "%1$[Instant Message]@ %2$[ends with]@ %3$@";

/* localize the predicate template for job title */
"%[jobTitle]@ %[is set]@" = "%1$[Job Title]@ %2$[is set]@";
"%[jobTitle]@ %[is not set]@" = "%1$[Job Title]@ %2$[is not set]@";

/* localize the predicate template for job title */
"%[jobTitle]@ %[is]@ %@" = "%1$[Job Title]@ %2$[is]@ %3$@";
"%[jobTitle]@ %[is not]@ %@" = "%1$[Job Title]@ %2$[is not]@ %3$@";
"%[jobTitle]@ %[contains]@ %@" = "%1$[Job Title]@ %2$[contains]@ %3$@";
"%[jobTitle]@ %[does not contain]@ %@" = "%1$[Job Title]@ %2$[does not contain]@ %3$@";

/* localize the predicate template for lastName */
"%[lastName]@ %[is set]@" = "%1$[Last Name]@ %2$[is set]@";
"%[lastName]@ %[is not set]@" = "%1$[Last Name]@ %2$[is not set]@";

/* localize the predicate template for lastName */
"%[lastName]@ %[is]@ %@" = "%1$[Last Name]@ %2$[is]@ %3$@";
"%[lastName]@ %[is not]@ %@" = "%1$[Last Name]@ %2$[is not]@ %3$@";
"%[lastName]@ %[contains]@ %@" = "%1$[Last Name]@ %2$[contains]@ %3$@";
"%[lastName]@ %[does not contain]@ %@" = "%1$[Last Name]@ %2$[does not contain]@ %3$@";

/* localize the predicate template for middleName */
"%[middleName]@ %[is set]@" = "%1$[Middle Name]@ %2$[is set]@";
"%[middleName]@ %[is not set]@" = "%1$[Middle Name]@ %2$[is not set]@";

/* localize the predicate template for middleName */
"%[middleName]@ %[is]@ %@" = "%1$[Middle Name]@ %2$[is]@ %3$@";
"%[middleName]@ %[is not]@ %@" = "%1$[Middle Name]@ %2$[is not]@ %3$@";
"%[middleName]@ %[contains]@ %@" = "%1$[Middle Name]@ %2$[contains]@ %3$@";
"%[middleName]@ %[does not contain]@ %@" = "%1$[Middle Name]@ %2$[does not contain]@ %3$@";

/* localize the predicate template for note */
"%[note]@ %[is set]@" = "%1$[Note]@ %2$[is set]@";
"%[note]@ %[is not set]@" = "%1$[Note]@ %2$[is not set]@";

/* localize the predicate template for note */
"%[note]@ %[is]@ %@" = "%1$[Note]@ %2$[is]@ %3$@";
"%[note]@ %[is not]@ %@" = "%1$[Note]@ %2$[is not]@ %3$@";
"%[note]@ %[contains]@ %@" = "%1$[Note]@ %2$[contains]@ %3$@";
"%[note]@ %[does not contain]@ %@" = "%1$[Note]@ %2$[does not contain]@ %3$@";

/* localize the predicate template for organization */
"%[organization]@ %[is set]@" = "%1$[Company]@ %2$[is set]@";
"%[organization]@ %[is not set]@" = "%1$[Company]@ %2$[is not set]@";

/* localize the predicate template for organization */
"%[organization]@ %[is]@ %@" = "%1$[Company]@ %2$[is]@ %3$@";
"%[organization]@ %[is not]@ %@" = "%1$[Company]@ %2$[is not]@ %3$@";
"%[organization]@ %[contains]@ %@" = "%1$[Company]@ %2$[contains]@ %3$@";
"%[organization]@ %[does not contain]@ %@" = "%1$[Company]@ %2$[does not contain]@ %3$@";

/* localize the predicate template for phone numbers */
"%[phoneNumbers.value.pd_stringByRemovingPhoneNumberDecorationCharacters]@ %[is set]@" = "%1$[Phone Number]@ %2$[is set]@";
"%[phoneNumbers.value.pd_stringByRemovingPhoneNumberDecorationCharacters]@ %[is not set]@" = "%1$[Phone Number]@ %2$[is not set]@";

/* localize the predicate template for phone numbers */
"%[phoneNumbers.value.pd_stringByRemovingPhoneNumberDecorationCharacters]@ %[is]@ %@" = "%1$[Phone Number]@ %2$[is]@ %3$@";
"%[phoneNumbers.value.pd_stringByRemovingPhoneNumberDecorationCharacters]@ %[is not]@ %@" = "%1$[Phone Number]@ %2$[is not]@ %3$@";
"%[phoneNumbers.value.pd_stringByRemovingPhoneNumberDecorationCharacters]@ %[contains]@ %@" = "%1$[Phone Number]@ %2$[contains]@ %3$@";
"%[phoneNumbers.value.pd_stringByRemovingPhoneNumberDecorationCharacters]@ %[does not contain]@ %@" = "%1$[Phone Number]@ %2$[does not contain]@ %3$@";
"%[phoneNumbers.value.pd_stringByRemovingPhoneNumberDecorationCharacters]@ %[begins with]@ %@" = "%1$[Phone Number]@ %2$[begins with]@ %3$@";
"%[phoneNumbers.value.pd_stringByRemovingPhoneNumberDecorationCharacters]@ %[ends with]@ %@" = "%1$[Phone Number]@ %2$[ends with]@ %3$@";

/* localize the predicate template for Card */
"%[self]@ %[contains]@ %@" = "%1$[Card]@ %2$[contains]@ %3$@";
"%[self]@ %[does not contain]@ %@" = "%1$[Card]@ %2$[does not contain]@ %3$@";
"%[self]@ %[was updated after]@ %@" = "%1$[Card]@ %2$[was updated after]@ %3$@";
"%[self]@ %[is member of]@ %@" = "%1$[Card]@ %2$[is member of]@ %3$@";
"%[self]@ %[is not member of]@ %@" = "%1$[Card]@ %2$[is not member of]@ %3$@";

/* localize the predicate template for Card */
"%[self]@ %[has not changed in]@ %@ %@" = "%1$[Card]@ %2$[has not changed in]@ %3$@ %4$@";
"%[self]@ %[has changed in]@ %@ %@" = "%1$[Card]@ %2$[has changed in]@ %3$@ %4$@";

/* localize the predicate template for Card */
"%[self]@ %[is person]@" = "%1$[Card]@ %2$[is person]@";
"%[self]@ %[is company]@" = "%1$[Card]@ %2$[is company]@";

/* localize the predicate template for urls and links */
"%[urls.value]@ %[is set]@" = "%1$[URL]@ %2$[is set]@";
"%[urls.value]@ %[is not set]@" = "%1$[URL]@ %2$[is not set]@";

/* localize the predicate template for urls and links */
"%[urls.value]@ %[is]@ %@" = "%1$[URL]@ %2$[is]@ %3$@";
"%[urls.value]@ %[is not]@ %@" = "%1$[URL]@ %2$[is not]@ %3$@";
"%[urls.value]@ %[contains]@ %@" = "%1$[URL]@ %2$[contains]@ %3$@";
"%[urls.value]@ %[does not contain]@ %@" = "%1$[URL]@ %2$[does not contain]@ %3$@";
"%[urls.value]@ %[begins with]@ %@" = "%1$[URL]@ %2$[begins with]@ %3$@";
"%[urls.value]@ %[ends with]@ %@" = "%1$[URL]@ %2$[ends with]@ %3$@";

